{
    "questoes": [
        {
            "tag": "compilacao",
            "padroes": [
                "Python é compilada?",
                "Python usa um compilador?"
            ],
            "respostas": [
                "Nao Python e uma linguagem interpretada. Voce pode tambem escrever bibliotecas Python utilizando C ou C++"
            ]
        },
        {
            "tag": "ferramenta",
            "padroes": [
                "Qual IDE utilizar?",
                "Qual ferramenta usar para programar?",
                "Qual editor de código usar?"
            ],
            "respostas": [
                "Nao ha uma real necessidade de uma IDE complexa e cheia de recursos para programar em Python. "
            ]
        },
        {
            "tag": "plataforma",
            "padroes": [
                "Só roda no Linux?",
                "Quais sistemas operacionais Python é suportado"
            ],
            "respostas": [
                "Alem de multiplataforma e multiparadigma, com o Python voce e capaz de desenvolver para qualquer tipo de ambiente, seja desktop, web ou movel."
            ]
        },
        {
            "tag": "web",
            "padroes": [
                "Dá pra desenvolver Web em Python?",
                "Consigo criar sistemas web?"
            ],
            "respostas": [
                "Python e excelente para desenvolver Web"
            ]
        },
        {
            "tag": "Mercado",
            "padroes": [
                "Quem usa o Python?",
                "Quais as principais empresas que utilizam Python?"
            ],
            "respostas": [
                "Instagram (utiliza Django como backend, um framework Pyrhon para a web) Google (grande parte do algoritmo de busca e escrito em Python) Spotify (o aplicativo e construído em Python) Netflix (utiliza muitas bibliotecas Python)"
            ]
        },
        {
            "tag": "DataScience",
            "padroes": [
                "Em que o Python é usado no Data Science?"
            ],
            "respostas": [
                "O Python e utilizado no data science em funcoes de Machine learning, visualizacao de dados e analise de dados"
            ]
        },
        {
            "tag": "Python",
            "padroes": [
                "O que é Python",
                "Para que serve o Python?"
            ],
            "respostas": [
                "O Python e uma linguagem de programacao de alto nivel e muito versatil. Ela suporta tanto a programação orientada a objetos quanto a programacao estruturada. Com Python, voce pode acessar bibliotecas nativas que oferecem funcionalidades para desenvolvimento de projetos e implementacao de aplicacoes complexas"
            ]
        },
        {
            "tag": "Vantagem",
            "padroes": [
                "Qual a vantagem de Python?"
            ],
            "respostas": [
                "O Python e considerado uma linguagem de alto nivel, pois e uma linguagem cuja sintaxe se aproxima mais da nossa linguagem e se distancia da linguagem de maquina. Alem disso, possui um nivel de abstracao que possibilita o entendimento do codigo mais facilmente"
            ]
        },
        {
            "tag": "Comparacao",
            "padroes": [
                "Qual a melhor linguagem Python ou r?"
            ],
            "respostas": [
                "R e extremamente eficiente em analise de dados, devido seu grande numero de pacotes com modelos, formulas e testes estatisticos. Python e otima para criação de scripts e automatização de regras para mineracao de dados. Se integra facilmente em um fluxo de trabalho de producao de desenvolvimento."
            ]
        },
        {
            "tag": "Biblioteca",
            "padroes": [
                "Voce e desenvolvimento em qual biblioteca?"
            ],
            "respostas": [
                "Tensorflow"
            ]
        },
        {
            "tag": "Origem",
            "padroes": [
                "De onde surgiu o nome Python?",
                "Qual a origem do nome Python?"
            ],
            "respostas": [
                "Ao contrario do que normalmente se pensa, a origem do nome da linguagem nao e a especie de serpente Piton e sim o grupo ingles de humoristas Monty Python. O uso da serpente como simbolo da linguagem se difundiu depois da publicação do ProgrammingPython da editora OReilly."
            ]
        },
        {
            "tag": "Criador",
            "padroes": [
                "Quem criou Python?"
            ],
            "respostas": [
                "Python foi criada por Guido van Rossum"
            ]
        },
        {
            "tag": "Nascimento",
            "padroes": [
                "Em qual ano Python foi criado?"
            ],
            "respostas": [
                "No ano de 1991"
            ]
        },
        {
            "tag": "Oficial",
            "padroes": [
                "Qual a pagina oficial do Python?"
            ],
            "respostas": [
                "www.python.org"
            ]
        },
        {
            "tag": "Aprender",
            "padroes": [
                "Como posso aprender a programar em Python?",
                "Cursos sobre Python?",
                "Aprender Python?"
            ],
            "respostas": [
                "https://www.youtube.com/watch?v=S9uPNppGsGo&list=PLvE-ZAFRgX8hnECDn1v9HNTI71veL3oW0"
            ]
        },
        {
            "tag": "Filosofia",
            "padroes": [
                "Qual a filosofia do Python?"
            ],
            "respostas": [
                "A linguagem foi projetada com a filosofia de enfatizar a importancia do esforco do programador sobre o esforco computacional."
            ]
        },
        {
            "tag": "Utilizacao",
            "padroes": [
                "Python e bastante usado?"
            ],
            "respostas": [
                "Sim! Segundo o indice TIOBE, e a segunda linguagem de programacao mais popular do mundo"
            ]
        }
    ]
}